views/layouts/main.php

SELECT * FROM `user` WHERE `id`=4
---
use yii\widgets\Breadcrumbs;
use app\assets\AppAsset;
if(isset(Yii::$app->user->id)) {
    $admin = User::findOne(Yii::$app->user->id);