views/layouts/sidebar.php

                <?php foreach ($categories as $category) : ?>
                    <li>
                        <a href="<?=Url::toRoute(['/site/category', 'id' => $category->id]) ?>"><?=$category->title ?></a>
                        <span class="post-count pull-right"><?=$category->getArticles()->count()?></span>
---
SELECT COUNT(*) FROM `article` WHERE `categoryId`=1