controllers/SiteController.php

    public function actionIndex()
    {
        $query = Article::find();
        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count(), 'PageSize' => 3]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->all();

        $posts = Article::find()->orderBy('viewed desc')->limit(3)->all();
        $lastPosts = Article::find()->orderBy('dateCurrentCreate desc')->limit(3)->all();
        $categories = Category::find()->all();
---
SELECT * FROM `article` LIMIT 1 OFFSET 1
SELECT COUNT(*) FROM `article`
SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
SELECT * FROM `article` ORDER BY `dateCurrentCreate` DESC LIMIT 3
SELECT * FROM `category`

    public function actionView($id)
    {
        $comment = new Comment();

        $article = Article::findOne($id);
        $posts = Article::find()->orderBy('viewed desc')->limit(3)->all();
        $lastPosts = Article::find()->orderBy('dateCurrentCreate desc')->limit(3)->all();
        $categories = Category::find()->all();
---
SELECT * FROM `article` WHERE `id`='3'
SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
SELECT * FROM `article` ORDER BY `dateCurrentCreate` DESC LIMIT 3
SELECT * FROM `category`

    public function actionCategory($id)
    {
        $query = Article::find()->where(['categoryId' => $id]) ;
        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count(), 'PageSize' => 6]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->all();

        $posts = Article::find()->orderBy('viewed desc')->limit(3)->all();
        $lastPosts = Article::find()->orderBy('dateCurrentCreate desc')->limit(3)->all();
        $categories = Category::find()->all();
---
SELECT COUNT(*) FROM `article` WHERE `categoryId`='2'
SELECT * FROM `article` WHERE `categoryId`='2' LIMIT 6
SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
SELECT * FROM `article` ORDER BY `dateCurrentCreate` DESC LIMIT 3
SELECT * FROM `category`

    public function actionComment($id)
    {
        $comment = new Comment();

        if (\Yii::$app->request->isPost)
        {
            $comment->load(\Yii::$app->request->post());
            $comment->userId = \Yii::$app->user->id;
            $comment->articleId = $id;

            if ($comment->save()) {
---
INSERT INTO `comment` (`text`, `userId`, `articleId`) VALUES ('j', 4, 3)