views/site/single.php




                <div class="bottom-comment"><!--bottom comment-->
                    <h3><?=$article->getComments()->count() ?> Comments:</h3>
---
SELECT * FROM `comment` WHERE `articleId`=3
SELECT COUNT(*) FROM `comment` WHERE `articleId`=3