models/Article.php

    public function saveArticle()
    {
        $this->userId = \Yii::$app->user->id;
        return $this->save();
---
UPDATE `article` SET `viewed`=5 WHERE `id`=10