models/LoginForm.php

SELECT * FROM `user` WHERE `email`='markov@gmail.com'
---
    public function getUser()
    {
        if ($this->_user === false) {
            $this->_user = User::findOne(['email' => $this->email]);